app/controllers/admin/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."released_at" DESC
---
    def index
      @articles = Article.order(released_at: :desc)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
    def destroy
      article = Article.find(params[:id])
      article.destroy