app/controllers/admin/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 9], ["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = ?, "is_approved" = ? WHERE "comments"."id" = ?  [["updated_at", "2021-08-26 17:51:01.190877"], ["is_approved", 0], ["id", 1]]
UPDATE "comments" SET "updated_at" = ?, "is_approved" = ? WHERE "comments"."id" = ?  [["updated_at", "2021-08-26 17:50:56.540848"], ["is_approved", 1], ["id", 1]]
---
    def update
      @article = Article.find(params[:article_id])
      @comment = @article.comments.find(params[:id])

      if @comment.is_approved?
        @comment.update(is_approved: false)
        flash[:success] = "The comment for \"#{@comment.name}\" has been regected."
        redirect_to admin_article_path(@article)
      else
        @comment.update(is_approved: true)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 9], ["id", 9], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
    def destroy
      article = Article.find(params[:article_id])
      comment = article.comments.find(params[:id])
      comment.destroy