app/controllers/admin/ratings_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."article_id" = ? AND "ratings"."id" = ? LIMIT ?  [["article_id", 9], ["id", 4], ["LIMIT", 1]]
UPDATE "ratings" SET "is_approved" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["is_approved", 0], ["updated_at", "2021-08-26 18:17:46.432273"], ["id", 4]]
UPDATE "ratings" SET "is_approved" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["is_approved", 1], ["updated_at", "2021-08-26 18:17:51.301090"], ["id", 3]]
---
    def update
      @article = Article.find(params[:article_id])
      @rating = @article.ratings.find(params[:id])

      if @rating.is_approved?
        @rating.update(is_approved: false)
        flash[:success] = "The rating of \"#{@rating.rating}\" has been regected."
        redirect_to admin_article_path(@article)
      else
        @rating.update(is_approved: true)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."article_id" = ? AND "ratings"."id" = ? LIMIT ?  [["article_id", 9], ["id", 3], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 6]]
---
    def destroy
      article = Article.find(params[:article_id])
      rating = article.ratings.find(params[:id])
      rating.destroy