app/views/admin/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 9]]
---
    <tbody>
      <% @article.comments.each do |comment| %>

SELECT "ratings".* FROM "ratings" WHERE "ratings"."article_id" = ?  [["article_id", 9]]
---
    <tbody>
      <% @article.ratings.each do |rating| %>