app/views/articles/show.html.erb

SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."article_id" = ?  [["article_id", 37]]
SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."article_id" = ?  [["article_id", 9]]
---
      <hr class="has-background-dark" />
      <h3 class="subtitle is-5"><%= @article.ratings.count %> reader(s) have given a weighted average rating of
        <strong><%= @article.ratings.average(:rating)&.round(1) || 0 %> </strong> out of 10

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 6]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 9]]
---
    <div class="column is-half">
      <h2 class="subtitle is-5"><strong><%= @article.comments.count %></strong> Comment (s)</h2>