app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (released_at < '2021-08-18 20:07:57.840912') AND "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @article = Article.released.find(params[:id])