app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(params[:comment].permit(:name, :body))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "John Doe"], ["body", "This is another one of John Doe's comments"], ["article_id", 9], ["created_at", "2021-08-26 12:01:06.299634"], ["updated_at", "2021-08-26 12:01:06.299634"]]

  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]