app/controllers/ratings_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
INSERT INTO "ratings" ("rating", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rating", 7], ["article_id", 37], ["created_at", "2021-08-23 06:25:46.419786"], ["updated_at", "2021-08-23 06:25:46.419786"]]
---
  def create
    @article = Article.find(params[:article_id])
    @rating = @article.ratings.create(params[:rating].permit(:rating))